import React from "react";

export const ModifySvg = () => {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="24.644"
      height="24.644"
      viewBox="0 0 24.644 24.644"
    >
      <g id="pencil" transform="translate(0 0)">
        <g id="그룹_40" data-name="그룹 40" transform="translate(0 0)">
          <path
            id="패스_74"
            data-name="패스 74"
            d="M23.877,3,21.644.765a2.62,2.62,0,0,0-3.7,0L1.328,17.382a.735.735,0,0,0-.2.379L.012,23.791a.722.722,0,0,0,.841.841l6.03-1.117a.735.735,0,0,0,.379-.2L23.877,6.7A2.616,2.616,0,0,0,23.877,3ZM1.623,23.021,2.3,19.373l2.972,2.972Zm5.128-1.237L2.86,17.892,17.069,3.682l3.892,3.892Zm16.1-16.106-.874.874L18.09,2.661l.874-.874a1.174,1.174,0,0,1,1.659,0L22.856,4.02A1.172,1.172,0,0,1,22.856,5.679Z"
            transform="translate(0 0)"
          />
        </g>
      </g>
    </svg>
  );
};
